app/Http/Controllers/Site/SiteController.php

select * from `plans` order by `price` asc
---
    public function index(){

        //Pega todos os  já com os detalhes, atraves do relacionamento "details"
        $plans = Plan::with('details')->orderBy('price', 'ASC')->get();