app/Http/Controllers/Admin/UserController.php

    public function index()
    {
        $users= $this->repository->tenantUser()->paginate();
---
select * from `users` where `tenant_id` = 1 limit 15 offset 0
select count(*) as aggregate from `users` where `tenant_id` = 1